"use strict";

// 1)
// let x = 5; alert( x++ ); - 5 постфікна


// 2)
// [] + false - null + true - 
// Пустий масив перетворюється в "" пусту строку
// получається "false" - null буде NaN
// NaN + true Буде NaN

// 3)
// let y = 1;
// // let x = y = 2;
// alert(x);  // 2 


// 4)
// [] + 1 + 2;

console.log('' + 1 + 2); // 12

// 5)
alert( "1"[0]); // 1

// 6)
console.log(2 && 1 && null && 0 && undefined); //  Оператор && запинается на лжи
// 2 - true 1 - true
// true and null(false) = null
// И запинается на лжи
// ИЛИ запинается на правде

// 7)
// console.log(!!(1 && 2) === (1 && 2)); // false
// !! - перетворює в boolean


// 8)
               // 3
// alert(null || 2 && 3 || 4);
// 2 && 3 - Коли в нас два аргументи при логічному порівнянні І 
//          рівні то оператор повертає останнє значення = 3


// 9)
const a = [1, 2, 3];
const b = [1, 2, 3];

a == b; // Це два різні масиви = false

// 10)
alert (+'Infinity'); // тип даних число

// 11)
console.log("Ёжик" > "яблоко"); // false

// 12)
console.log(0 || "" || 2 || undefined || true || false); //  2
// И запинается на лжи
// ИЛИ запинается на правде